<a href="https://colab.research.google.com/github/superherobtf1985/pandas2/blob/master/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandasの基本2

In [0]:
import pandas as pd

In [2]:
game_df = pd.read_csv("game1.csv")
game_df

   user_id game_genre   age  playing_time(days) cellphone
0        1     puzzle  17.0                  98       iOS
1        2   shooting  34.0                  35       iOS
2        3     puzzle  23.0                 267   Android
3        4     puzzle   NaN                  45       iOS
4        5   shooting  14.0                  90       iOS
5        6     racing   NaN                  16   Android

cellphoneカラムをdevice_typeに変更する

In [3]:
game_df = game_df.rename(columns={"cellphone": "device_type"})
game_df

   user_id game_genre   age  playing_time(days) device_type
0        1     puzzle  17.0                  98         iOS
1        2   shooting  34.0                  35         iOS
2        3     puzzle  23.0                 267     Android
3        4     puzzle   NaN                  45         iOS
4        5   shooting  14.0                  90         iOS
5        6     racing   NaN                  16     Android

欠陥値のある行を削除

In [4]:
game_df = game_df.dropna().reset_index(drop=True)
game_df

   user_id game_genre   age  playing_time(days) device_type
0        1     puzzle  17.0                  98         iOS
1        2   shooting  34.0                  35         iOS
2        3     puzzle  23.0                 267     Android
3        5   shooting  14.0                  90         iOS

ファイルに書き込み

In [0]:
game_df.to_csv("game1_formatted.csv")

## データ整形をする

In [6]:
game2_df = pd.read_csv("game2.csv")
game2_df

   user_id game_genre  billing_amount(¥)  playing_time(days)  ranking
0        1     puzzle             1000.0                  98      153
1        2   shooting                NaN                  35      978
2        3     puzzle             5000.0                 267        8
3        4     puzzle                NaN                  45     1032
4        5   shooting             2000.0                  90       91
5        6     racing              300.0                  16      875

rankingカラムを削除する

In [7]:
game2_df = game2_df.drop("ranking", axis=1)
game2_df

   user_id game_genre  billing_amount(¥)  playing_time(days)
0        1     puzzle             1000.0                  98
1        2   shooting                NaN                  35
2        3     puzzle             5000.0                 267
3        4     puzzle                NaN                  45
4        5   shooting             2000.0                  90
5        6     racing              300.0                  16

欠損値を0で埋める

In [8]:
game2_df = game2_df.fillna(0)
game2_df

   user_id game_genre  billing_amount(¥)  playing_time(days)
0        1     puzzle             1000.0                  98
1        2   shooting                0.0                  35
2        3     puzzle             5000.0                 267
3        4     puzzle                0.0                  45
4        5   shooting             2000.0                  90
5        6     racing              300.0                  16

billing_amount(\)カラムの値が降順になるようにソート

In [9]:
game2_df = game2_df.sort_values("billing_amount(¥)", ascending=False)
game2_df

   user_id game_genre  billing_amount(¥)  playing_time(days)
2        3     puzzle             5000.0                 267
4        5   shooting             2000.0                  90
0        1     puzzle             1000.0                  98
5        6     racing              300.0                  16
1        2   shooting                0.0                  35
3        4     puzzle                0.0                  45

CSVファイルに書き出し

In [0]:
game2_df.to_csv("game2_formatted.csv")